#23-0227 mon home 19:42

#
library(tidyverse)

#join
홈런 <- tibble(연도=c(2003, 1999, 2015, 2003, 2014, 2015, 2002, 2015, 2002, 2017),
             선수=c('이승엽', '이승엽', '박병호', '심정수', '박병호', 
                  '나바로', '이승엽', '테임즈', '심정수', '최정'),
             홈런=c(56, 54, 53, 53, 52, 48, 47, 47, 46, 46),
             팀=c('삼성', '삼성', '넥센', '현대', '넥센', '삼성', '삼성', 
                 'NC', '현대', 'SK'))

팀 <- tibble(팀=c('KIA', 'KT', 'LG', 'NC', 'SK', '넥센', '두산', '롯데', 
                '삼성', '한화'),
            애칭=c('타이거즈', '위즈', '트윈스', '다이노스', '와이번스', 
                 '히어로즈', '베어스', '자이언츠', '라이온즈', '이글스'))

홈런
팀


#join
홈런 <- tibble(연도=c(2003, 1999, 2015, 2003, 2014, 2015, 2002, 2015, 2002, 2017),
             선수=c('이승엽', '이승엽', '박병호', '심정수', '박병호', 
                  '나바로', '이승엽', '테임즈', '심정수', '최정'),
             홈런=c(56, 54, 53, 53, 52, 48, 47, 47, 46, 46),
             팀=c('삼성', '삼성', '넥센', '현대', '넥센', '삼성', '삼성', 
                 'NC', '현대', 'SK'))

팀 <- tibble(팀=c('KIA', 'KT', 'LG', 'NC', 'SK', '넥센', '두산', '롯데', 
                '삼성', '한화'),
            애칭=c('타이거즈', '위즈', '트윈스', '다이노스', '와이번스', 
                 '히어로즈', '베어스', '자이언츠', '라이온즈', '이글스'))

팀



#vlookup
inner_join(홈런,팀)        #
left_join(홈런,팀)         #
right_join(홈런,팀)        #
full_join(홈런,팀)

anti_join(홈런,팀)
semi_join(홈런,팀)


홈런
팀

left_join(홈런,팀)
right_join(홈런,팀)
inner_join(홈런,팀)

홈런
팀
left_join(홈런,팀)
anti_join(홈런,팀)
semi_join(홈런,팀)
